farmertan81/Spot-Welder/STM32G474CE/src/main.c
#include <math.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "stm32g4xx_hal.h"

/* ===== Forward decls ===== */
static void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM1_Init(void);
static void MX_ADC1_Init(void);
static void MX_I2C1_Init(void);
static void i2c_bus_recovery(void);

static void uartSend(const char* s);
static inline void pwmOff(void);
static inline void pwmOnDuty(uint16_t duty);
static void clampParams(void);
static void applyArmTimeout(void);
static void applyReadyTimeout(void);
static uint16_t pctToDuty(uint8_t pct);
static inline void delayMsExact(uint16_t ms);
static void doPulseMsPwm(uint16_t ms, uint16_t duty);
static void fireRecipe(void);
static void parseCommand(char* line);
static void pollPedal(void);
static void pollContactTrigger(void);
static uint32_t adcReadChannel(uint32_t channel);
static float readThermistor(void);
static float readCapVoltage(void);
static bool contactDetected(void);

/* NEW: Shunt Sensing Forward Decl */
static uint32_t adcReadFast(uint32_t channel);
static float capturePulseAmps(uint16_t ms);

/* NEW: INA226 Forward Decl */
static bool ina226_write_reg(uint8_t addr, uint8_t reg, uint16_t val);
static bool ina226_read_reg(uint8_t addr, uint8_t reg, uint16_t* val);
static bool ina226_read_bus_voltage(uint8_t addr, float* voltage);
static bool ina226_read_shunt_current(uint8_t addr, float* current);
static bool ina226_health_check(void);
static void ina226_read_all(void);
static void chargerStateMachine(void);
static void sendStatusPacket(void);

/* ============ Pins (fixed) ============ */
#define WELD_TIM TIM1
#define WELD_TIM_CH TIM_CHANNEL_1
#define PEDAL_PORT GPIOB
#define PEDAL_PIN GPIO_PIN_12
#define LED_PORT GPIOC
#define LED_PIN GPIO_PIN_6

#define CONTACT_PORT GPIOA
#define CONTACT_PIN GPIO_PIN_6

/* NEW: Charger enable pin */
#define CHARGER_EN_PORT GPIOB
#define CHARGER_EN_PIN GPIO_PIN_2

/* ============ Billet Shunt Calibration (0.3885" @ 15mm) ============ */
#define AMPS_PER_ADC_STEP 0.1093f  // Calibrated scaling factor for your billet

/* ============ Thermistor / ADC ============ */
#define THERM_SERIES_R 10000.0f
#define THERM_NOMINAL_R 10000.0f
#define THERM_NOMINAL_T 25.0f
#define THERM_BETA 3950.0f
#define THERM_OFFSET_C 0.0f

#define V_CAP_DIVIDER 8.47f

/* ============ INA226 Addresses ============ */
#define INA226_ADDR_PACK 0x40
#define INA226_ADDR_NODE1 0x41
#define INA226_ADDR_NODE2 0x44

/* ============ INA226 Registers ============ */
#define INA226_REG_CONFIG 0x00
#define INA226_REG_SHUNT_V 0x01
#define INA226_REG_BUS_V 0x02
#define INA226_REG_CALIBRATION 0x05

/* ============ INA226 Shunt Resistor ============ */
#define INA226_SHUNT_R 0.0002f /* 200 µΩ */
/* Rev1 charge current correction factor (matches ESP32 value) */
#define CHARGE_CURRENT_CORRECTION 1.0f

/* ============ Charger Thresholds (INA226 ONLY) ============ */
#define CHG_VPACK_ON 8.7f  /* Turn charger ON below this */
#define CHG_VPACK_OFF 9.07f /* Turn charger OFF at/above this */

/* ============ INA226 Scaling ============ */
#define V_NODE1_SCALE 1.000f
#define V_NODE2_SCALE 0.9860f
#define VPACK_SCALE 1.000f

/* ============ Limits / Timing ============ */
static const uint32_t WELD_COOLDOWN_MS = 500;
static const uint16_t MAX_WELD_MS = 200;
static const uint32_t PEDAL_DEBOUNCE_MS = 40;
static const uint32_t BOOT_INHIBIT_MS = 5000;
static const uint32_t ARM_TIMEOUT_MS = 0;
static const uint32_t READY_TIMEOUT_MS = 1500;

/* ============ PWM Settings ============ */
static const uint16_t PWM_MAX = 1023;
static const uint16_t TIM1_PSC = 0;
static const uint32_t TIM1_ARR = 16999;

/* ============ HAL handles ============ */
UART_HandleTypeDef huart1;
TIM_HandleTypeDef htim1;
ADC_HandleTypeDef hadc1;
I2C_HandleTypeDef hi2c1;

/* ============ Weld Params (defaults) ============ */
static volatile uint8_t weld_mode = 1;
static volatile uint16_t weld_d1_ms = 10;
static volatile uint16_t weld_gap1_ms = 0;
static volatile uint16_t weld_d2_ms = 0;
static volatile uint16_t weld_gap2_ms = 0;
static volatile uint16_t weld_d3_ms = 0;

static volatile uint8_t weld_power_pct = 100;
static volatile bool preheat_enabled = false;
static volatile uint16_t preheat_ms = 20;
static volatile uint8_t preheat_pct = 30;
static volatile uint16_t preheat_gap_ms = 3;

/* ============ Trigger Settings ============ */
static volatile uint8_t trigger_mode = 1;        // 1 = pedal, 2 = contact
static volatile uint8_t contact_hold_steps = 2;  // each step = 500 ms
static volatile uint8_t contact_with_pedal =
    1;  // 1 = require contact in pedal mode (safe default)

/* ============ State ============ */
static volatile bool welding_now = false;
static uint32_t last_weld_ms = 0;

static bool armed = false;
static uint32_t armed_until_ms = 0;
static uint32_t boot_ms = 0;

static bool system_ready = false;
static uint32_t ready_until_ms = 0;

static GPIO_PinState pedal_last_raw = GPIO_PIN_SET;
static GPIO_PinState pedal_stable = GPIO_PIN_SET;
static uint32_t pedal_last_change_ms = 0;

static float temp_filtered_c = 25.0f;
static float current_peak_amps = 0.0f;  // Track peak of recipe

/* Added calibration capture values */
static float cal_vcap_before = 0.0f;
static float cal_vcap_after = 0.0f;
static uint32_t cal_adc_peak_raw = 0;
static float cal_current_avg = 0.0f;

/* ============ Contact trigger state ============ */
static bool contact_hold_active = false;
static uint32_t contact_hold_start_ms = 0;
static bool contact_fire_lock = false;

/* ============ INA226 state (CONTROL SYSTEM) ============ */
static volatile bool ina226_ok = false;
static float ina_vpack = 0.0f;
static float vlow = 0.0f;      /* TAP_LOW  (0x41) – bottom of stack */
static float vmid = 0.0f;      /* TAP_MID  (0x44) – middle tap      */
static float ina_cell1 = 0.0f; /* Bottom cell: vlow                  */
static float ina_cell2 = 0.0f; /* Middle cell: vmid - vlow           */
static float ina_cell3 = 0.0f; /* Top cell:    vpack - vmid          */
static float ina_ichg = 0.0f;

/* ============ Charger state ============ */
static bool charger_enabled = false;

/* ============ UART RX Buffer ============ */
#define RX_LINE_MAX 128
static uint8_t rx_byte;
static char rx_build[RX_LINE_MAX];
static uint8_t rx_idx = 0;
static char rx_ready[RX_LINE_MAX];
static volatile bool rx_line_ready = false;

/* ============ UART debug ============ */
#define DEBUG_UART_RX 1
static volatile uint32_t uart_rx_bytes = 0;
static volatile uint32_t uart_rx_errors = 0;
static volatile uint32_t uart_rx_overruns = 0;

/* ============ INA226 Bare-Metal I2C Driver ============ */

