farmertan81/Spot-Welder/STM32G474CE/src/main.c
static bool ina226_write_reg(uint8_t addr, uint8_t reg, uint16_t val) {
    uint8_t data[2];
    data[0] = (val >> 8) & 0xFF;
    data[1] = val & 0xFF;
    HAL_StatusTypeDef st = HAL_I2C_Mem_Write(&hi2c1, (uint16_t)(addr << 1), reg,
                                             I2C_MEMADD_SIZE_8BIT, data, 2, 10);
    return (st == HAL_OK);
}

static bool ina226_read_reg(uint8_t addr, uint8_t reg, uint16_t* val) {
    uint8_t data[2];
    HAL_StatusTypeDef st = HAL_I2C_Mem_Read(&hi2c1, (uint16_t)(addr << 1), reg,
                                            I2C_MEMADD_SIZE_8BIT, data, 2, 10);
    if (st != HAL_OK) return false;
    *val = ((uint16_t)data[0] << 8) | data[1];
    return true;
}

static bool ina226_read_bus_voltage(uint8_t addr, float* voltage) {
    uint16_t raw;
    if (!ina226_read_reg(addr, INA226_REG_BUS_V, &raw)) return false;
    *voltage = raw * 0.00125f; /* 1.25 mV/bit */
    return true;
}

static bool ina226_read_shunt_current(uint8_t addr, float* current) {
    uint16_t raw;
    if (!ina226_read_reg(addr, INA226_REG_SHUNT_V, &raw)) return false;
    int16_t signed_raw = (int16_t)raw;
    float shunt_voltage_v = signed_raw * 0.0000025f; /* 2.5 µV/bit */
    float calculated_current = shunt_voltage_v / INA226_SHUNT_R;
    *current = (-calculated_current) * CHARGE_CURRENT_CORRECTION;
    if (fabsf(*current) < 0.05f) *current = 0.0f;
    if (fabsf(*current) > 50.0f) *current = 0.0f;
    return true;
}

static bool ina226_health_check(void) {
    /* Verify all three sensors respond using HAL_I2C_IsDeviceReady (3 trials,
     * 10ms) */
    if (HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t)(INA226_ADDR_PACK << 1), 3,
                              10) != HAL_OK)
        return false;
    if (HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t)(INA226_ADDR_NODE1 << 1), 3,
                              10) != HAL_OK)
        return false;
    if (HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t)(INA226_ADDR_NODE2 << 1), 3,
                              10) != HAL_OK)
        return false;
    return true;
}

static void ina226_read_all(void) {
    /* Step 1: Verify all three sensors are present on the bus */
    if (!ina226_health_check()) {
        ina226_ok = false;
        /* Safety: disable charger if any sensor missing */
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    float vp = 0, vl = 0, vm = 0, ichg = 0;
    bool ok = true;

    if (!ina226_read_bus_voltage(INA226_ADDR_PACK, &vp)) ok = false;
    if (!ina226_read_bus_voltage(INA226_ADDR_NODE1, &vl)) ok = false;
    if (!ina226_read_bus_voltage(INA226_ADDR_NODE2, &vm)) ok = false;
    if (!ina226_read_shunt_current(INA226_ADDR_PACK, &ichg)) ok = false;

    ina226_ok = ok;

    if (!ok) {
        /* Safety: disable charger on read failure */
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    ina_vpack = vp * VPACK_SCALE;
    vlow = vl * V_NODE1_SCALE;
    vmid = vm * V_NODE2_SCALE;

    /* Correct cell voltage math:
     * [Pack-] ── Cell_Bot ── (vlow/0x41) ── Cell_Mid ── (vmid/0x44) ── Cell_Top
     * ── [Pack+]
     */
    ina_cell1 = vlow;             /* Bottom cell */
    ina_cell2 = vmid - vlow;      /* Middle cell */
    ina_cell3 = ina_vpack - vmid; /* Top cell    */

    ina_ichg = ichg;
}

/* ============ Charger State Machine (INA226 ONLY) ============ */

static void chargerStateMachine(void) {
    /* SAFETY: INA226 failure → charger OFF */
    if (!ina226_ok) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* DISARMED → charger OFF */
    if (!armed) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* WELDING → charger OFF */
    if (welding_now) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
        return;
    }

    /* ARMED: hysteresis control using INA226 ina_vpack */
    if (ina_vpack >= CHG_VPACK_OFF) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
        charger_enabled = false;
    } else if (ina_vpack <= CHG_VPACK_ON) {
        HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_SET);
        charger_enabled = true;
    }
    /* Between CHG_VPACK_ON and CHG_VPACK_OFF: maintain current state */
}

/* ============ UART Status Packets (split into two for ESP32 parsing)
 * ============ */

static void sendStatusPacket(void) {
    char buf[192];

    /* --- Packet 1: STATUS (system state, ADC-based diagnostics) --- */
    float vcap = readCapVoltage();
    float power_f = (float)weld_power_pct;
    snprintf(buf, sizeof(buf),
             "STATUS,armed=%d,ready=%d,welding=%d,vcap=%.2f,"
             "temp=%.2f,mode=%d,power=%.2f",
             armed ? 1 : 0, system_ready ? 1 : 0, welding_now ? 1 : 0, vcap,
             temp_filtered_c, (int)weld_mode, power_f);
    uartSend(buf);

    /* --- Packet 2: STATUS2 (INA226 telemetry) --- */
    snprintf(buf, sizeof(buf),
             "STATUS2,ina_ok=%d,chg_en=%d,vpack=%.2f,vlow=%.2f,"
             "vmid=%.2f,cell1=%.2f,cell2=%.2f,cell3=%.2f,ichg=%.2f",
             ina226_ok ? 1 : 0, charger_enabled ? 1 : 0, ina_vpack, vlow, vmid,
             ina_cell1, ina_cell2, ina_cell3, ina_ichg);
    uartSend(buf);
}

/* ============ Shunt Sensing Functions ============ */
static uint32_t adcReadFast(uint32_t channel) {
    ADC_ChannelConfTypeDef sConfig = {0};
    sConfig.Channel = channel;
    sConfig.Rank = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_6CYCLES_5;  // Speed for pulses
    sConfig.SingleDiff = ADC_SINGLE_ENDED;
    if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK) return 0xFFFF;
    HAL_ADC_Start(&hadc1);
    if (HAL_ADC_PollForConversion(&hadc1, 1) != HAL_OK) {
        HAL_ADC_Stop(&hadc1);
        return 0xFFFF;
    }
    uint32_t val = HAL_ADC_GetValue(&hadc1);
    HAL_ADC_Stop(&hadc1);
    return val;
}

static float capturePulseAmps(uint16_t ms) {
    uint32_t peak_raw = 0;
    uint32_t start = HAL_GetTick();

