farmertan81/Spot-Welder/STM32G474CE/src/main.c
    while ((HAL_GetTick() - start) < ms) {
        uint32_t p = adcReadFast(ADC_CHANNEL_2);  // Adjust channel to wiring
        uint32_t n = adcReadFast(ADC_CHANNEL_3);  // Adjust channel to wiring
        if (p != 0xFFFF && n != 0xFFFF) {
            int32_t diff = (int32_t)p - (int32_t)n;
            uint32_t abs_diff = (diff < 0) ? -diff : (uint32_t)diff;
            if (abs_diff > peak_raw) peak_raw = abs_diff;
        }
    }

    cal_adc_peak_raw = peak_raw;

    float pulse_peak = (float)peak_raw * AMPS_PER_ADC_STEP;
    if (pulse_peak > current_peak_amps) current_peak_amps = pulse_peak;
    return pulse_peak;
}

/* ============ Helpers ============ */
static void uartSend(const char* s) {
    HAL_UART_Transmit(&huart1, (uint8_t*)s, (uint16_t)strlen(s), 50);
    HAL_UART_Transmit(&huart1, (uint8_t*)"\r\n", 2, 50);
}

static inline void pwmOff(void) {
    __HAL_TIM_SET_COMPARE(&htim1, WELD_TIM_CH, 0);
}

static inline void pwmOnDuty(uint16_t duty) {
    if (duty > PWM_MAX) duty = PWM_MAX;

    uint32_t ccr =
        ((uint32_t)duty * (uint32_t)(TIM1_ARR + 1U)) / (uint32_t)(PWM_MAX + 1U);
    if (ccr > TIM1_ARR) ccr = TIM1_ARR;

    __HAL_TIM_SET_COMPARE(&htim1, WELD_TIM_CH, ccr);
}

static bool contactDetected(void) {
    return HAL_GPIO_ReadPin(CONTACT_PORT, CONTACT_PIN) == GPIO_PIN_RESET;
}

static void clampParams(void) {
    if (weld_mode < 1) weld_mode = 1;
    if (weld_mode > 3) weld_mode = 3;

    if (weld_d1_ms > MAX_WELD_MS) weld_d1_ms = MAX_WELD_MS;
    if (weld_d2_ms > MAX_WELD_MS) weld_d2_ms = MAX_WELD_MS;
    if (weld_d3_ms > MAX_WELD_MS) weld_d3_ms = MAX_WELD_MS;

    if (weld_power_pct < 50) weld_power_pct = 50;
    if (weld_power_pct > 100) weld_power_pct = 100;

    if (preheat_pct > 100) preheat_pct = 100;
    if (preheat_ms > MAX_WELD_MS) preheat_ms = MAX_WELD_MS;

    if (trigger_mode < 1) trigger_mode = 1;
    if (trigger_mode > 2) trigger_mode = 2;

    if (contact_hold_steps < 1) contact_hold_steps = 1;
    if (contact_hold_steps > 10) contact_hold_steps = 10;
}

static void applyArmTimeout(void) {
    if (ARM_TIMEOUT_MS == 0) return;
    if (!armed) return;
    if (armed_until_ms == 0) return;

    uint32_t now = HAL_GetTick();
    if ((int32_t)(now - armed_until_ms) >= 0) {
        armed = false;
        armed_until_ms = 0;
        uartSend("EVENT,ARM_TIMEOUT");
    }
}

static void applyReadyTimeout(void) {
    if (!system_ready) return;
    if (READY_TIMEOUT_MS == 0) return;

    uint32_t now = HAL_GetTick();
    if ((int32_t)(now - ready_until_ms) >= 0) {
        system_ready = false;
        ready_until_ms = 0;
        uartSend("EVENT,READY_TIMEOUT");
    }
}

static uint16_t pctToDuty(uint8_t pct) {
    if (pct >= 100) return PWM_MAX;
    return (uint16_t)((uint32_t)pct * PWM_MAX / 100U);
}

static inline void delayMsExact(uint16_t ms) {
    if (ms == 0) return;
    if (ms > MAX_WELD_MS) ms = MAX_WELD_MS;

    uint32_t start = HAL_GetTick();
    while ((HAL_GetTick() - start) < ms) {
        __NOP();
    }
}

static void doPulseMsPwm(uint16_t ms, uint16_t duty) {
    if (ms == 0) return;
    if (ms > MAX_WELD_MS) ms = MAX_WELD_MS;

    pwmOnDuty(duty);
    capturePulseAmps(ms);  // Measure while FET is on
    pwmOff();
}

static void fireRecipe(void) {
    uint32_t now_ms = HAL_GetTick();

    if (now_ms - boot_ms < BOOT_INHIBIT_MS) {
        char buf[64];
        snprintf(buf, sizeof(buf), "DENY,BOOT_INHIBIT,ms=%lu",
                 (unsigned long)(BOOT_INHIBIT_MS - (now_ms - boot_ms)));
        uartSend(buf);
        return;
    }

    applyArmTimeout();
    applyReadyTimeout();

    if (!system_ready) {
        uartSend("DENY,NOT_READY");
        return;
    }

    if (!armed) {
        uartSend("DENY,NOT_ARMED");
        return;
    }

    if (temp_filtered_c > 65.0f) {
        uartSend("DENY,OVERHEAT");
        return;
    }

    {
        bool need_contact = true;
        if (trigger_mode == 1 && contact_with_pedal == 0) {
            need_contact = false;  // pedal mode with contact check disabled
        }
        if (need_contact && !contactDetected()) {
            uartSend("DENY,NO_CONTACT");
            return;
        }
    }

    if (welding_now) {
        uartSend("DENY,ALREADY_WELDING");
        return;
    }

    uint32_t since = now_ms - last_weld_ms;
    if (since < WELD_COOLDOWN_MS) {
        char buf[64];
        snprintf(buf, sizeof(buf), "DENY,COOLDOWN,ms=%lu",
                 (unsigned long)(WELD_COOLDOWN_MS - since));
        uartSend(buf);
        return;
    }

    clampParams();

    /* === WELD SEQUENCE (modified per refactor plan) === */

    /* Step 1: Disable charger */
    HAL_GPIO_WritePin(CHARGER_EN_PORT, CHARGER_EN_PIN, GPIO_PIN_RESET);
    charger_enabled = false;

    /* Step 2: Wait 50ms for charger to settle */
    HAL_Delay(50);

    welding_now = true;
    current_peak_amps = 0.0f;

    /* Step 3: ADC diagnostic snapshot BEFORE weld (diagnostic only) */
    cal_vcap_before = readCapVoltage();

    uartSend("EVENT,WELD_START");

    pwmOff();
    HAL_Delay(2);

    uint32_t t0 = HAL_GetTick();

    /* === Execute weld pulse (HRTIM/PWM code UNTOUCHED) === */
    if (preheat_enabled && preheat_ms > 0) {
        doPulseMsPwm(preheat_ms, pctToDuty(preheat_pct));
        if (preheat_gap_ms > 0) {
            pwmOff();
            delayMsExact(preheat_gap_ms);
        }
    }

    uint16_t mainDuty = pctToDuty(weld_power_pct);

    if (weld_mode >= 1) {
        doPulseMsPwm(weld_d1_ms, mainDuty);
    }
    if (weld_mode >= 2) {
        if (weld_gap1_ms) delayMsExact(weld_gap1_ms);
        doPulseMsPwm(weld_d2_ms, mainDuty);
    }
    if (weld_mode >= 3) {
        if (weld_gap2_ms) delayMsExact(weld_gap2_ms);
        doPulseMsPwm(weld_d3_ms, mainDuty);
    }

    uint32_t total_ms = HAL_GetTick() - t0;

    pwmOff();
    welding_now = false;
    last_weld_ms = HAL_GetTick();

    /* Step 5: Wait 50ms post-weld */
    HAL_Delay(50);

    /* Step 6: ADC diagnostic snapshot AFTER weld (diagnostic only) */
    cal_vcap_after = readCapVoltage();

    float cap_F = 666.0f;
    float delta_v = cal_vcap_before - cal_vcap_after;
    float time_s = total_ms / 1000.0f;

