farmertan81/Spot-Welder/STM32G474CE/src/main.c
    if ((now - pedal_last_change_ms) >= PEDAL_DEBOUNCE_MS) {
        if (raw != pedal_stable) {
            GPIO_PinState prev = pedal_stable;
            pedal_stable = raw;

            if (prev == GPIO_PIN_SET && pedal_stable == GPIO_PIN_RESET) {
                uartSend("EVENT,PEDAL_PRESS");
                if (trigger_mode == 1) {
                    fireRecipe();
                }
            }
        }
    }
}

static void pollContactTrigger(void) {
    if (trigger_mode != 2) {
        contact_hold_active = false;
        contact_hold_start_ms = 0;
        contact_fire_lock = false;
        return;
    }

    bool contact_now = contactDetected();
    uint32_t now = HAL_GetTick();
    uint32_t hold_ms_required = (uint32_t)contact_hold_steps * 500U;

    if (!contact_now) {
        contact_hold_active = false;
        contact_hold_start_ms = 0;
        contact_fire_lock = false;
        return;
    }

    if (contact_fire_lock) {
        return;
    }

    if (!contact_hold_active) {
        contact_hold_active = true;
        contact_hold_start_ms = now;
        return;
    }

    if ((now - contact_hold_start_ms) >= hold_ms_required) {
        uartSend("EVENT,CONTACT_TRIGGER");
        fireRecipe();
        contact_fire_lock = true;
    }
}

int main(void) {
    HAL_Init();
    SystemClock_Config();
    SystemCoreClockUpdate();
    HAL_InitTick(TICK_INT_PRIORITY);

    MX_GPIO_Init();

    /* 100ms delay for INA226 power rail stabilization */
    HAL_Delay(100);

    for (int i = 0; i < 3; i++) {
        HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
        HAL_Delay(80);
    }

    /* I2C bus recovery before initialization – unstick any hung devices */
    i2c_bus_recovery();

    MX_I2C1_Init(); /* I2C1 for INA226 sensors – graceful, no hang */
    MX_USART1_UART_Init();
    MX_ADC1_Init();
    MX_TIM1_Init();

    HAL_TIM_PWM_Start(&htim1, TIM_CHANNEL_1);
    pwmOff();

    boot_ms = HAL_GetTick();

    GPIO_PinState r = HAL_GPIO_ReadPin(PEDAL_PORT, PEDAL_PIN);
    pedal_last_raw = r;
    pedal_stable = r;
    pedal_last_change_ms = boot_ms;

    /* NEW: Initialize INA226 sensors */
    {
        /* INA226 0x40 (pack): reset + configure */
        ina226_write_reg(INA226_ADDR_PACK, INA226_REG_CONFIG, 0x8000);
        HAL_Delay(20);
        /* CONFIG: AVG=16, VBUSCT=1.1ms, VSHCT=1.1ms, MODE=cont shunt+bus */
        uint16_t ina_config = (0x02 << 9) | (0x04 << 6) | (0x04 << 3) | 0x07;
        ina226_write_reg(INA226_ADDR_PACK, INA226_REG_CONFIG, ina_config);
        HAL_Delay(10);
        /* Calibration register (same as ESP32 used) */
        ina226_write_reg(INA226_ADDR_PACK, INA226_REG_CALIBRATION, 41967);
        HAL_Delay(10);

        /* INA226 0x41 (node1): reset + configure (bus voltage only) */
        ina226_write_reg(INA226_ADDR_NODE1, INA226_REG_CONFIG, 0x8000);
        HAL_Delay(20);
        ina226_write_reg(INA226_ADDR_NODE1, INA226_REG_CONFIG, ina_config);
        HAL_Delay(10);

        /* INA226 0x44 (node2): reset + configure (bus voltage only) */
        ina226_write_reg(INA226_ADDR_NODE2, INA226_REG_CONFIG, 0x8000);
        HAL_Delay(20);
        ina226_write_reg(INA226_ADDR_NODE2, INA226_REG_CONFIG, ina_config);
        HAL_Delay(10);

        /* Initial read to populate values */
        ina226_read_all();
    }

    uartSend("BOOT,STM32G474_WELD_BRAIN_10KHZ_READY");

    HAL_UART_Receive_IT(&huart1, &rx_byte, 1);

    while (1) {
        pollPedal();
        pollContactTrigger();
        applyArmTimeout();
        applyReadyTimeout();

        {
            static int last_contact_dbg = -1;
            int c = contactDetected() ? 1 : 0;
            if (c != last_contact_dbg) {
                last_contact_dbg = c;
                if (c)
                    uartSend("DBG,CONTACT=1");
                else
                    uartSend("DBG,CONTACT=0");
            }
        }

        {
            static uint32_t last_temp_ms = 0;
            uint32_t now = HAL_GetTick();
            if ((now - last_temp_ms) >= 1000) {
                last_temp_ms = now;
                float t = readThermistor();
                if (t > -50.0f && t < 200.0f) {
                    temp_filtered_c = (0.1f * t) + (0.9f * temp_filtered_c);
                }
            }
        }

        /* NEW: INA226 read + charger state machine @ ~100ms interval */
        {
            static uint32_t last_ina_ms = 0;
            uint32_t now = HAL_GetTick();
            if ((now - last_ina_ms) >= 100) {
                last_ina_ms = now;
                ina226_read_all();
                chargerStateMachine();
            }
        }

        /* Send STATUS + STATUS2 packets every 500ms */
        {
            static uint32_t last_chgstat_ms = 0;
            uint32_t now = HAL_GetTick();
            if ((now - last_chgstat_ms) >= 500) {
                last_chgstat_ms = now;
                sendStatusPacket();
            }
        }

        if (rx_line_ready) {
            char local_line[RX_LINE_MAX];
            __disable_irq();
            memcpy(local_line, rx_ready, sizeof(local_line));
            rx_line_ready = false;
            __enable_irq();
            parseCommand(local_line);
        }

#if DEBUG_UART_RX
        {
            static uint32_t last_health = 0;
            uint32_t now = HAL_GetTick();
            if (now - last_health >= 5000) {
                last_health = now;
                char hb[128];
                snprintf(hb, sizeof(hb),
                         "RXHEALTH,bytes=%lu,errors=%lu,overruns=%lu",
                         (unsigned long)uart_rx_bytes,
                         (unsigned long)uart_rx_errors,
                         (unsigned long)uart_rx_overruns);
                uartSend(hb);

                if (huart1.RxState == HAL_UART_STATE_READY) {
                    HAL_UART_Receive_IT(&huart1, &rx_byte, 1);
                    uartSend("RXHEALTH,REARM");
                }
            }
        }
#endif
    }
}

void SysTick_Handler(void) {
    HAL_IncTick();
    HAL_SYSTICK_IRQHandler();
}

void USART1_IRQHandler(void) { HAL_UART_IRQHandler(&huart1); }
